rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37.h
/*
** ###################################################################
**     Processor:           S32K37_M7
**     Compiler:            Keil ARM C/C++ Compiler
**     Reference manual:    S32K37 RM Rev.3
**     Version:             rev. 2.0, 2024-03-28
**     Build:               b240328
**
**     Abstract:
**         Peripheral Access Layer for S32K37_M7
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2024 NXP
**
**     NXP Confidential and Proprietary. This software is owned or controlled
**     by NXP and may only be used strictly in accordance with the applicable
**     license terms. By expressly accepting such terms or by downloading,
**     installing, activating and/or otherwise using the software, you are
**     agreeing that you have read, and that you agree to comply with and are
**     bound by, such license terms. If you do not agree to be bound by the
**     applicable license terms, then you may not retain, install, activate
**     or otherwise use the software.
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
** -rev.1.0 Jalaj Awasthi 18-Aug-21 Initial release based on 
**                                   RM Rev.1 Draft C
**
** -rev.1.1 Jalaj Awasthi 09-Sept-21 1)Initial release based                
**                                 on RM Rev.1 Draft D.                   
**                                 2)ADC_BIST-                            
**                                 In BISTCFG register                    
**                                 Bit fields DACCOREN and UITFEN         
**                                 are added                              
**                                 In BISTCTL register                    
**                                 Bit field UITFCONV is added            
**                                 In BISTSTAT register                   
**                                 Bit field ALGSTAT is added             
**                                 In SDCFG register                      
**                                 Bit field SDCOREN is removed           
**                                 3)DCM-                                 
**                                 In DCMMISC register                    
**                                 Bit field MRKLSTRCHK is removed.       
**                                 DCMROP register is removed             
**                                 In DCMROD4 register                    
**                                 Bit field FLASH_ECC_ERR is removed     
**                                 and FLASH_ACCESS_ERR is added.         
**                                 4)DCM_GPR-                             
**                                 In DCMROF20 register                   
**                                 Bit field CM7_TCM_WS_EN is removed     
**                                 In DCMRWD4 register                    
**                                 Bit field FLASH_ECC_ERR_EN is removed  
**                                 and FLASH_ACCESS_ERR_EN is added.      
**                                 5)DSPSS-                               
**                                 In DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL    
**                                 register                               
**                                 Bit field RESET_REQ_FIFO_PTR_SCHD_FSM  
**                                 is removed.                            
**                                 Bit fields DSP_ACK_TIMEOUT_ERR_TH0,    
**                                 DSP_ACK_TIMEOUT_ERR_TH1,               
**                                 DSP_ACK_TIMEOUT_ERR_TH2,               
**                                 DSP_ACK_TIMEOUT_ERR_TH3 are added.     
**                                 In ECC_ERROR_MONITOR_THREAD_SUSPEND    
**                                 _CTRL register                         
**                                 Bit fields THRD_DIS_ON_MBIT_ECC_ERR    
**                                 _XMEM_EVEN, THRD_DIS_ON_MBIT_ECC_ERR   
**                                 _XMEM_ODD, THRD_DIS_ON_MBIT_ECC_ERR    
**                                 _PMEM are removed.                     
**                                 In INTERRUPT_ENABLE_REGISTER2 register 
**                                 Bit field SDADC_SYNC_FIFO_UNDERRUN_IE  
**                                 is removed.                            
**                                 6)EIM_2-                               
**                                 In EICHEN register                     
**                                 bit field EICH20EN, EICH19EN,          
**                                 EICH2EN are added.                     
**                                 Registers EICHD2_WORD1, EICHD2_WORD2   
**                                 are added.                             
**                                 Registers EICHD19_WORD1, EICHD19_WORD2,
**                                 EICHD20_WORD1, EICHD20_WORD2 are added.
**                                 7)I3C-                                 
**                                 In MCONFIG_EXT register                
**                                 Bit fields I2CBLOW, I2CHS, I2C_A10B,   
**                                 I2C_A10BEXT are added.                 
**                                 8)MDM_AP-                              
**                                 In MDMAPDTSEN register                 
**                                 Bit fields DTSEN, DTSENB, DTSENC,      
**                                 DTSEND are added.                      
**                                 In MDMAPDTSSTARTUP, MDMAPDTSSTARTUPB,  
**                                 MDMAPDTSSTARTUPC, MDMAPDTSSTARTUPD     
**                                 registers, bit field AD is added.      
**                                 In MDMAPDTSSEMAPHORE,                  
**                                 MDMAPDTSSEMAPHOREB, MDMAPDTSSEMAPHOREBC
**                                 , MDMAPDTSSEMAPHOREBD, registers,      
**                                 bit field ST is added.                 
**                                 In MDMAPETPUCTRLEN register            
**                                 Bit fields ETPU_ATID, ETPU_SPACE_THRES,
**                                 APB_SLOT_SEL are added.                
**                                 In MDMAPETPUSTTSEN register            
**                                 Bit fields OVERFLOW, UNDERRUN,         
**                                 ETPU_EVTI_0, ETPU_EVTI_1 are added     
**                                 9)PFLASH-                             
**                                 In PFCR register                       
**                                 Bit fields P0_DBFEN, P0_DPFEN are added
**                                 10)QuadSPI-                            
**                                 In SFACR register,                     
**                                 Bit field CAS_INTRLVD is added         
**                                 FRAD_WORD0, FRAD_WORD1, FRAD_WORD2,    
**                                 FRAD_WORD3, FRAD_WORD4, FRAD_WORD5,    
**                                 FRAD, TGMDAD, TGSFAR, TGSFARS, TGIPCRS,
**                                 MDAD, MGC, MRC, MTO, FLSEQREQ, FSMSTAT,
**                                 IPSERROR, ERRSTAT, INT_EN registers    
**                                 are added.                             
**                                 11)QuadSPI_SFP module is removed       
**                                 12)STCU-                               
**                                 In LBSSW register                      
**                                 Bit fields LBSSW0…..LBSSW31 are removed
**                                 In LBESW register                      
**                                 Bit fields LBESW0…..LBESW31 are removed
**                                 In MBESW register                      
**                                 Bit fields MBESW16…...MBESW31          
**                                 are removed.                           
**                                 In MBUFM register                      
**                                 Bit fields MBUFM17..MBUFM31 are removed
**                                 In MISRELSW register                   
**                                 Bit field size of MISRESWX is changed  
**                                 from 4 to 32                           
**                                 In MISRRLSW register                   
**                                 Bit field size of MISRRSWX is changed  
**                                 from 4 to 32.                          
**                                 In LB_struct register                  
**                                 Bit fields MISREHSW, MISRRHSW are added
**                                 13)TCD-                                
**                                 Module name TCD is changed to TCD_0    
**                                 Similar changes for other registers    
**                                 In TCD0_CSR register                   
**                                 Bit field EEOP is removed              
**                                 In TCD1_CSR register                   
**                                 Bit field EEOP is removed              
**                                 In TCD2_CSR register                   
**                                 Bit field EEOP is removed              
**                                 In TCD3_CSR register                   
**                                 Bit field EEOP is removed              
**                                 In TCD4_CSR register                   
**                                 Bit field EEOP is removed              
**                                 In TCD5_CSR register                   
**                                 Bit field EEOP is removed              
**                                 Similar changes…...till  TCD31_CSR     
**                                 registers.                             
**                                 14)VIRT_WRAPPER-                       
**                                 Register REG_A31_16 is added           
**                                 REG_B is changed to REG_B1023_1008     
**                                 15)XRDC-                               
**                                 In PDAC_SLOT register                  
**                                 Bit field PDACN size is changed        
**                                 from 48 to 50                          
**
**-rev.1.2 Jalaj Awasthi 13-Oct-21 1)Initial release based               
**                                 on RM Rev.1 Draft E.                   
**                                 2)ADC_BIST module is removed           
**                                 3)DCM-                                 
**                                 DCMROP, DCMROD, DCMROF,                
**                                 DCMRWP, DCMRWD, DCMRWF,                
**                                 DCMROPP, DCMROFT, DCMRWPP,             
**                                 DCMRWFT registers are added.           
**                                 4)DSPI_MSC-                            
**                                 In MCR register                        
**                                 Bit field DOZE is removed and XSPI     
**                                 is added.                              
**                                 CTAR register is added                 
**                                 In SR register                         
**                                 bit fields TFIWF, DDIF, CMDTCF,        
**                                 BSYF, DSITCF, SPITCF are added.        
**                                 In RSER register                       
**                                 Bit fields CMDFFF_DIRS, TFIWF_RE,      
**                                 DDIF_RE, CMDTCF_RE, DSITCF_RE,         
**                                 SPITCF_RE, CMDFFF_RE are added.        
**                                 PUSHR register is added.               
**                                 DSICR0, SDR0, ASDR0, COMPR0,           
**                                 DDR0, DSICR1, SSR0, DIMR0, DPIR0,      
**                                 SDR1, ASDR1, COMPR1, DDR1,             
**                                 SSR1, DIMR1, DPIR1, CTARE, SREX,       
**                                 TSL, TS_CONF registers are added.      
**                                 5)EIM_1-                               
**                                 In EICHEN register                     
**                                 Bit field EICH17EN is added            
**                                 EICHD17_WORD1, EICHD17_WORD2           
**                                 registers are added.                   
**                                 6)EIM_2-                               
**                                 In EICHEN register                     
**                                 Bit field EICHEN, EICH19EN,            
**                                 EICH2EN are removed.                   
**                                 EICHD2_WORD1, EICHD2_WORD2             
**                                 registers are removed.                 
**                                 EICHD2_WORD2, EICHD19_WORD2,           
**                                 EICHD20_WORD1, EICHD20_WORD2 registers 
**                                 are removed.                           
**                                 7)I3C-                                 
**                                 In SCONFIG register                    
**                                 Bit field HDROK is changed to DDROK    
**                                 In SSTATUS register                    
**                                 Bit field HDRMATCHED is changed        
**                                 to HDRMATCH.                           
**                                 In MERRWARN register                   
**                                 Bit field URUN is added.               
**                                 8)MSCM-                                
**                                 In ENEDC register                      
**                                 Bit fields STAM, QSPI are added        
**                                 In IAHBCFGREG register                 
**                                 Bit fields CM7_0_AHBS_DIS_WR_OPT,      
**                                 CM7_1_AHBS_DIS_WR_OPT,                 
**                                 CM7_2_AHBS_DIS_WR_OPT are added.       
**                                 9)OMU_CM7-                             
**                                 In OER register                        
**                                 Bit field ZRGUE is added               
**                                 GZRR register is added                 
**                                 10)PLL-                                
**                                 In PLLODIV register                    
**                                 Bit field value of DIV                 
**                                 is changed from 4 to 8.                 
**                                 11)QuadSPI-                            
**                                 In IPCR register                       
**                                 Bit fields ARB_LOCK,                   
**                                 ARB_UNLOCK are added.                  
**                                 In DLLCRA register                     
**                                 Bit field DLL_CDL8 is added.           
**                                 In MDAD_TGIPCRS register               
**                                 Bit fields ARB_LOCK, ARB_UNLOCK        
**                                 are added.                            
**                                 In FLSEQREQ register                   
**                                 Bit field ARB_LOCK is added            
**                                 In FSMSTAT register                    
**                                 Bit field ARB_LOCK is added.           
**                                 12)SDADC-                              
**                                 In MCR register                        
**                                 Bit field TMSTMPEN is removed          
**                                 13)VIRT_WRAPPER-                       
**                                 In REG_A15_0 register                  
**                                 bit fields PAD_11, PAD_12….PAD_15      
**                                 are removed.                           
**                                 REG_A31_16, REG_A47_32, REG_A63_48,    
**                                 REG_A79_64, REG_A95_80, REG_A111_96,   
**								   REG_A127_112, REG_A143_128, REG_A159   
**								   _144, REG_A175_160, REG_A191_176,      
**								   REG_A207_192, REG_A223_208,            
**								   REG_A239_224, REG_A255_240,            
**								   REG_A271_256, REG_A287_272,            
**								   registers are added.                   
**                                 In REG_A303_288 register               
**                                 Bit field PAD_11 is removed.           
**                                 In REG_A319_304 register               
**                                 Bit fields PAD_6, PAD_7 are removed    
**                                 In REG_A335_320 register               
**                                 Bit fields PAD_14, PAD_15 are removed  
**                                 In REG_A367_352 register               
**                                 Bit fields PAD_6 is removed            
**                                 In REG_A415_400 register               
**                                 Bit fields PAD_3, PAD_13 are removed   
**                                 In REG_A431_416 register               
**                                 Bit fields PAD_6, PAD_8, PAD_9         
**                                 are removed.                           
**                                 ...similar changes till REG_A511_496   
**                                 Registers REG_B527_512,                
**                                 REG_B543_528, REG_B559_544,            
**								   REG_B575_560, REG_B591_576,            
**								   REG_B607_592, REG_B623_608,            
**								   …....REG_B783_768 are removed          
**                                 In REG_B815_800 register               
**                                 Bit field INMUX_11 is removed          
**                                 Similar changes are present in         
**                                 chapter till REG_B1023_1008 register.
**
**-rev.1.3 Jalaj Awasthi 16-Nov-21 1)Initial release based               
**                                 on RM Rev.1 Draft G.                  
**                                 2)ADC_BIST module is added            
**                                 3)DCM-                                
**                                 DCMROP, DCMROD, DCMROF,               
**                                 DCMRWP, DCMRWD, DCMRWF,               
**                                 DCMROPP, DCMROFT, DCMRWPP,            
**                                 DCMRWFT registers are removed.        
**                                 4)DSPI-                               
**                                 -In DSPI_MSC register                 
**                                 PCSIS bitfield size is changed        
**                                 from 1 to 2.                          
**                                 -In MSC_PUSHR register                
**                                 PCS bitfield size is changed          
**                                 from 1 to 2.                          
**                                 5)D_IP_SWG_SYN-                       
**                                 -In CTRL register                     
**                                 S0H1 and WINDOW bitfields are added.  
**                                 6)ETPU-                               
**                                 -In MCR register                      
**                                 LTO2 and LTO1 bitfields are removed.  
**                                 LM0CR_ENG1, LM0MR_ENG1, LM1CR_ENG1,   
**                                 LM1MR_ENG1, LM2CR_ENG1, LM2MR_ENG1,   
**								   LM3CR_ENG1, LM3MR_ENG1, LM4CR_ENG1,   
**								   LM4MR_ENG1, LM5CR_ENG1, LM5MR_ENG1,   
**								   LM0CR_ENG2, LM0MR_ENG2, LM1CR_ENG2,   
**								   LM1MR_ENG2, LM2CR_ENG2, LM2MR_ENG2,   
**								   LM3CR_ENG2, LM3MR_ENG2, LM4CR_ENG2,   
**								   LM4MR_ENG2, LM5CR_ENG2 and LM5MR_ENG2 
**								   registers are removed.                
**                                 7)FLEXCAN-                            
**                                 MB array size is changed from 32 to 64
**                                 8)FLEXPWM-                            
**                                 -In following regiters SM0FRCTRL_OCTRL
**                                 SM1FRCTRL_OCTRL,                      
**								   SM2FRCTRL_OCTRL, SM3FRCTRL_OCTRL     
**								   TEST bitfield is removed.             
**                                 DLLPRG register is removed.           
**                                 -In SMBIST_STATUS register            
**                                 INTERNAL_DEBUG bitfield is removed.   
**                                 9)FlexCAN_1-                          
**                                 MB array size is changed from 64 to 96.
**                                 10)FlexCAN_2-                         
**                                 MB array size is changed from 64 to 96.
**                                 11)FlexCAN_3-                         
**                                 MB array size is changed from 64 to 96.
**                                 MB_CS registers are updated          
**                                 12)I3C-                               
**                                 -In MCONFIG register                  
**                                 PERLOW bitfield is added.             
**                                 -In SCONFIG register                  
**                                 DDROK bitfield is renamed as HDROK.   
**                                 -SMSGMAPADDR register is removed.     
**                                 -SMSGLAST register is added.          
**                                 13)IGF-                               
**                                 -In MCR register                      
**                                 RFM and FFM bitfield’s size is changed
**                                 from 2 to 3.                          
**                                 -In PRESR register                    
**                                 FPRE bitfield’s size is changed       
**                                 from 5 to 10.                         
**                                 -In RTHR register                     
**                                 RTH bitfield’s size is changed        
**                                 from 5 to 24.                         
**                                 -In FTHR register                     
**                                 FTH bitfield’s size is changed        
**                                 from 5 to 24.                         
**                                 -PRESR1, PRESR2…PRESR15, PRESR17,     
