rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37.h
**                                 PRESR18… PRESR31 registers are removed.
**                                 14)MC_CGM-                            
**                                 -In MUX_11_DC_0 register              
**                                 DIV bitfield’s size is changed        
**                                 from 3 to 4.                          
**                                 15)MDM_AP-                            
**                                 In MDMAPSTTS register                  
**                                 CM72HLT, CM72DPSLP, CM72SLPNG and     
**                                 CM72DBGRSTRD bitfields are added.     
**                                 16)MSCM-                              
**                                 -In XN_CTRL reginster                 
**                                 -PRAM_2 bitfield is  removed.         
**                                 -ITCM1_BK_XNCM7_1_ITCM               
**                                 -SLK and HLK bitfields are added.   
**                                 17)VIRT_WRAPPER-                      
**                                 -In REG_B0 register.                  
**                                 INMUX_6, INMUX_7, INMUX_8, INMUX_9,   
**                                 INMUX_10, INMUX_14 and INMUX_15     
**								   bitfields are removed.                
**                                 -In REG_B1 register                   
**                                 INMUX_11 bitfield is added.           
**                                 -In REG_B2 register                   
**                                 INMUX_6 and INMUX_7 bitfields         
**                                 are added.                            
**                                 -In REG_B3 register                 
**                                 INMUX_14 and INMUX_15 bitfields       
**                                 are added.                            
**                                 -In REG_B9 register                  
**                                 INMUX_0, INMUX_1, INMUX_2, INMUX_3,   
**                                 INMUX_4 and INMUX_5 are added         
**                                 REG_B5, REG_B6, REG_B7, REG_B8 and    
**								   REG_B12 registers are removed.        
**								   REG_B15, REG_B16, REG_B18, REG_B19,   
**                                 REG_B21, REG_B22, REG_B23… REG_B31 are
**								   added.                                
**								   18)ETPU_5 instance is removed.        
**                                 19)Separate instance of TRGMUX_APP_tag
**                                 and TRGMUX_MSC_tag created.                                                                         
**
**-rev.1.4 Jalaj Awasthi 11-Mar-22 1)Initial release based               
**                                 on RM Rev.1 Draft I.                 
**                                 2)FXOSC-                              
**                                 -In CTRL register                     
**                                 ALC_D bit field is added.             
**                                 3)I3C-                                
**                                 SDYNADDR register is removed.         
**                                 4)LPI2C-                              
**                                 -In MCFGR0 register                   
**                                 bitfield HRPOL is added.              
**                                 5)PFLASH-                             
**                                 -PFCR size is changed from 1 to 4.    
**                                 6)QuadSPI-                            
**                                 -Register SFACR is removed.           
**                                 -In RSER register                     
**                                 Bit field IPAEIE is removed.          
**                                 LM1MR_ENG1, LM2CR_ENG1, LM2MR_ENG1,   
**                                 7)SDADC-                              
**                                 -In MCR register                      
**                                 bit field EMSEL is added.             
**                                 Bit field IPAEIE is removed.          
**                                 Register TCR is added.                
**                                 8)STCU-                               
**                                 -In MBSSW0 register                   
**                                 bit fields MBSSW12, MBSSW13, MBSSW14, 
**                                 MBSSW15 are removed.                  
**                                 -In MBESW0 register                   
**                                 bit fields MBESW12, MBESW13, MBESW14, 
**                                 MBESW15 are removed.                  
**                                 -In MBUFM0 register                   
**                                 bit fields MBUFM12, MBUFM13, MBUFM14, 
**                                 MBUFM15 are removed.                  
**                                 9)TRGMUX_APP-                         
**                                 -CM7_2_RXEV is changed to CM7_RXEV.   
**                                 10)Module name CMP is changed LPCMP.  
**                                 11)CONFIGURATION_GPR-                 
**                                 -In In GPR_CONFIG_REG6 register       
**                                 Bit field SAI_SDID_PCTL is removed.   
**                                 12)DCM_GPR-                           
**                                 -In DCMROF20 register                 
**                                 bit fields DMA_AXBS_IAHB_BYP and      
**                                 AIPS_IAHB_BYP are removed.            
**                                 -In DCMRWD6 register                  
**                                 bit fields EMIOS1_DBG_DIS_CM7_0,      
**                                 EMIOS2_DBG_DIS_CM7_0,                 
**								   SAI0_DBG_DIS_CM7_0,                   
**								   SAI1_DBG_DIS_CM7_0 are removed.       
**                                 -In DCMRWD8 register                  
**                                 bit fields EMIOS1_DBG_DIS_CM7_1,      
**                                  EMIOS2_DBG_DIS_CM7_1,                
**								   SAI0_DBG_DIS_CM7_1,                   
**								   SAI1_DBG_DIS_CM7_1 are removed.       
**                                 In DCMRWD12 register                  
**                                 bit fields EMIOS1_DBG_DIS_CM7_2,      
**                                 EMIOS2_DBG_DIS_CM7_2,                 
**								   SAI0_DBG_DIS_CM7_2,                   
**								   SAI1_DBG_DIS_CM7_2 are removed.       
**                                 -DCMRWF3 register is added.           
**                                 13)D_IP_SWG_SYN-                      
**                                 -In CTRL register                     
**                                 bit fields S0H1, TRIG_EN are removed. 
**                                 Bit field TRIG_MODE is added.         
**                                 14)EMAC-                              
**                                 -Registers MAC_VLAN_INCL_MAC_VLAN_INCL0
**                                 , MAC_VLAN_INCL_MAC_VLAN_INCL1,       
**								   MAC_VLAN_INCL_MAC_VLAN_INCL2,         
**								   VLAN_INCL_MAC_VLAN_INCL3,             
**								   VLAN_INCL_MAC_VLAN_INCL4,             
**								   VLAN_INCL_MAC_VLAN_INCL5,             
**								   MAC_VLAN_INCL_MAC_VLAN_INCL6,         
**								   MAC_VLAN_INCL_MAC_VLAN_INCL7 are added
**                                 15)FLEXCAN-                           
**                                 -In HR_TIME_STAMP register            
**                                 The bit field value of FLEXCAN_MB is  
**                                 changed from 64 to 32.                
**                                 16)FlexCAN_1-                         
**                                 -In ERFFEL register                   
**                                 The bit field value of FlexCAN_1_MB is
**                                 changed from 96 to 64.                
**                                 17)FlexCAN_3-                         
**                                 -The bit field value of FlexCAN_3_MB  
**                                 is changed from 64 to 32.             
**                                 18)IGF-                              
**                                 -In MCR_PRESR registe                 
**                                 The bit field value of FPRE is        
**                                 changed from 10 to 6.                 
**                                 -In MCR_RTHR register                 
**                                 The bit field value of RTH is         
**                                 changed from 24 to 6.                 
**                                 -In MCR_FTHR register                 
**                                 The bit field value of FTH is changed 
**                                 from 24 to 6.                         
**                                 19)LPI2C-                             
**                                 -In MCFGR0 register                   
**                                 HRPOL bit field is removed.           
**                                 -In MCFGR0 register                   
**                                 Bit field HRPOL is removed.           
**                                 20)OMU_CM7-                           
**                                 -In ZESR register                     
**                                 bit field Z0R...Z7R is changed to     
**                                 Z0ES…..Z7ES.                          
**                                 21)SIUL2-                             
**                                 -In MIDR4 register                    
**                                 bit field name is changed from        
**                                 CORE_PLAT_FET to CORE_PLAT_FET_2      
**                                 bit field CORE_PLAT_FET_1 is added.   
**                                 -Registers GPDO39, GPDO38 are removed.
**                                 GPDO221, GPDO220 registers are removed.
**                                 -GPDI39, GPDI38 registers are removed.
**                                 GPDI221 register is removed           
**                                 -In PGPDO2 register                   
**                                 bit fields PPDO8, PPDO9 are removed   
**                                 -In PGPDO13 register                  
**                                 bit fields PPDO2, PPDO3 are removed   
**                                 -In PGPDI2 register                   
**                                 bit fields PPDI8, PPDI9 are removed  
**                                 -In PGPDI13 register                  
**                                 bit fields PPDI2, PPDI3 are removed   
**                                 22)VIRT_WRAPPER-                      
**                                 -In REG_B22 register                  
**                                 bit fields INMUX_0, INMUX_1 are added.
**                                 23)MU-                                
**                                 -CR0 and CSSR0 registers are added.   
**                                 -In FCR register                      
**                                 bit fields F3…...F31 are added.       
**                                 -In FSR register                      
**                                 bit fields F3…...F31 are added.       
**                                 -In GIER register                     
**                                 bit fields GIE1….GIE31 are added.     
**                                 -In GCR register                      
**                                 bit fields GIR1….GIR31 are added.     
**                                 -In GSR register                      
**                                 bit fields GIP1….GIP31 are added.     
**                                 24)MUB is removed.                    
**                                 25)ETPU_7 is changed to ETPU_6.       
**
**-rev.1.5 Shivansh Kumar 7-Jun-22 1)Initial release based               
**                                 on RM Rev.1 Draft J.
**                                 2)CONFIGURATION_GPR-                   
**                                 -In CONFIG_REG6 register               
**                                 Bit field HL is changed to HARD_LOCK.  
**                                 -In CONFIG_PE_LOCK register            
**                                 Bit field PE_LOCK_UTEST is removed.    
**                                 3)DCM-                                 
**                                 -In DCMLCC register                    
**                                 Bit fields DCMLCFN and DCMFLC are      
**                                 removed.                               
**                                 -In DCMLCS register                    
**                                 Bit fields DCMLCSS1, DCMLCC1, DCMLCE1, 
**                                 DCMLCFE1, DCMLCSS2, DCMLCC2, DCMLCE2,  
**                                 DCMLCFE2 are removed.                  
**                                 4)DCM_GPR-                             
**                                 -In DCMROD1 register                   
**                                 Bit fields HSE_DCF_VIO and             
**                                 KEY_RESP_READY are removed.            
**                                 -In DCMRWD4 register                   
**                                 Bit field HSE_RAM_ECC_ERR_EN is          
**                                 removed.                               
**                                 -In DCMRWD5 register                   
**                                 Bit field HSE_RDATA_EDC_ERR_EN is      
**                                 removed.                               
**                                 -In DCMROPP2 register                  
**                                 Bit fields POR_WDG_STAT33,             
**                                 POR_WDG_STAT34, POR_WDG_STAT37,        
**                                 POR_WDG_STAT42, POR_WDG_STAT43,        
**                                 POR_WDG_STAT44, POR_WDG_STAT45,        
**                                 POR_WDG_STAT46, POR_WDG_STAT47,        
**                                 POR_WDG_STAT49, POR_WDG_STAT50,        
**                                 POR_WDG_STAT51, POR_WDG_STAT53,        
**                                 POR_WDG_STAT54, POR_WDG_STAT55,        
**                                 POR_WDG_STAT56, POR_WDG_STAT57,        
**                                 POR_WDG_STAT58, POR_WDG_STAT59,        
**                                 POR_WDG_STAT60, POR_WDG_STAT63 are     
**                                 removed.                               
**                                 -In DCMROPP3 register                  
**                                 Bit fields POR_WDG_STAT65,             
**                                 POR_WDG_STAT66, POR_WDG_STAT69,        
**                                 POR_WDG_STAT71, POR_WDG_STAT75,        
**                                 POR_WDG_STAT77, POR_WDG_STAT83,        
**                                 POR_WDG_STAT84, POR_WDG_STAT85,        
**                                 POR_WDG_STAT86, POR_WDG_STAT87,        
**                                 POR_WDG_STAT88, POR_WDG_STAT89,        
**                                 POR_WDG_STAT90, POR_WDG_STAT91,        
**                                 POR_WDG_STAT92, POR_WDG_STAT95 are     
**                                 removed.                               
**                                 5)DSPSS-                               
**                                 -In DSPSS_SCHEDULER_XMEM_TH0 register  
**                                 Bit fields RSVD4, RSVD3, RSVD5, RSVD2, 
**                                 RSVD1 are removed.                     
**                                 -In DSP_CORE_BUFFER_STATUS0 register   
**                                 Bit field RSVD is removed.             
**                                 -In DSPSS_SCHEDULER_XMEM_TH1 register  
**                                 Bit fields RSVD4, RSVD3, RSVD5, RSVD2, 
**                                 RSVD1 are removed.                     
**                                 -In DSP_CORE_BUFFER_STATUS1 register   
**                                 Bit field RSVD is removed.             
**                                 -In DSPSS_SCHEDULER_XMEM_TH2 register  
**                                 Bit fields RSVD4, RSVD3, RSVD5, RSVD2, 
**                                 RSVD1 are removed.                     
**                                 -In DSP_CORE_BUFFER_STATUS2 register   
**                                 Bit field RSVD is removed.             
**                                 -In DSPSS_SCHEDULER_XMEM_TH3 register  
**                                 Bit fields RSVD4, RSVD3, RSVD5, RSVD2, 
**                                 RSVD1 are removed.                     
**                                 -In DSP_CORE_BUFFER_STATUS3 register   
**                                 Bit field RSVD is removed.             
**                                 -In SDADC_SYNC_FIFO_ERROR_STATUS       
**                                 register                               
**                                 Bit field RSVD is removed.             
**                                 -In DSPSS_DSP0_CFG register            
**                                 Bit fields RSVD1, RSVD2, RSVD3 are     
**                                 removed.                               
**                                 6)D_IP_SWG_SYN-                        
**                                 -In CTRL register                      
**                                 Bit field TRIG_SEL is removed. 
**                                 7)EMIOS is changed eMIOS        
**                                 8)ETPU-                                
**                                 -CxCR_ENG1, CxSCR_ENG1 and CxHSSR_ENG1 
**                                 registers are merged into CCR_ENG1     
**                                 array                                  
**                                 -CxCR_ENG2, CxSCR_ENG2 and CxHSSR_ENG2 
**                                 registers are merged into CCR_ENG2     
**                                 array  
**                                 9)FLEXCAN-
**                                 -All instances are merged together.                                
**                                 10)MDM_AP-                              
**                                 -In MDMAPCTL register                  
**                                 Bit field CM72DBGREQ and CM72DBGRSRT   
**                                 are added.                             
**                                 11)MSCM-                                
**                                 -In ENEDC register                     
**                                 Bit field STAM is removed.             
**                                 12)QuadSPI-                            
**                                 -Register SFACR is added.              
**                                 13)SDA_AP-                             
**                                 -In SDAAPRSTCTRL register              
**                                 Bit field RSTRELTLCM72 is added.       
**                                 14)SIUL2-                              
**                                 -Registers UDR1, UDR0, UDR3, UDR2,     
**                                 UDR5, UDR4, UDR7, UDR6 are removed     
**                                 -Registers MUX0_TIMER_EN1,             
**                                 MUX0_BCTU1_EN, MUX1_TIMER_EN0,         
**                                 MUX1_BCTU0_EN, MUX1_MISC_EN,           
**                                 MUX2_TIMER_EN1, MUX2_BCTU1_EN,         
**                                 MUX2_MISC_EN registers are added.      
**                                 -In MSCR register                      
**                                 Bit field SSS_3 is added. 
**
**-rev.1.6 Jalaj Awasthi 04-Aug-22 1)Initial release based               
**                                 on RM Rev.1                           
**                                 2)ADC_BIST_FIR-                       
**                                 -In FIR_CNTRL register                
**                                 Bit field OSRSEL is removed.          
**                                 -COEFF register is removed            
**                                 3)CONFIGURATION_GPR-                  
**                                 -Registers CONFIG_RAMPR, CONFIG_CFPRL,
**                                 CONFIG_CFPRH, CONFIG_DFPR,            
**								   CONFIG_PE_LOCK, CONFIG_RAMPR_ALT,     
**								   CONFIG_CFPRL_ALT, CONFIG_CFPRH_ALT,   
**								   CONFIG_DFPR_ALT, CONFIG_REG_GPR are   
**								   removed.                              
**                                 Bit fields DCMLCFN and DCMFLC are     
**                                 removed.                              
**                                 -In DCMLCS register                   
**                                 Bit fields DCMLCSS1, DCMLCC1, DCMLCE1,
**                                 DCMLCFE1, DCMLCSS2, DCMLCC2, DCMLCE2, 
**                                 DCMLCFE2 are removed.                 
**                                 4)DCM_GPR-                            
**                                 -In DCMROD4 register                  
**                                 FLASH_ACCESS_ERR bit field is removed 
**                                 FLASH_ECC_ERR bit field is added.     
**                                 CM7_2_LOCKUP bit field is added       
**                                 -In DCMROD5 register                    
**                                 Bit field MTR_BUS_ERR is removed      
**                                 and MCT_BUS_ERR is added.             
**                                 -In DCMROD6 register                  
**                                 Bit fields QSPI_FLASHA_ECC_ERR and    
**                                 ETPU_GLEX_ERR are added.              
**                                 Bit field DSPSS_CORE_MEM_ECC3_ERR is  
**                                 removed.                              
**                                 -In DCMROD7 register                  
**                                 Bit fields VDDA_SDADC0_GNG_ERR,       
**                                 VDDA_SDADC1_GNG_ERR, VDDA_SWG_GNG_ERR,
**                                 -In DCMRWD5 register                  
**                                 Bit field MTR_BUS_ERR_EN is removed   
**                                 and MCT_BUS_ERR_EN is added.          
**                                 -In DCMRWF1 register                  
**                                 Bit field RMII_MII is removed         
**                                 bit fields EMAC_CONF, LFAST_RX_MM_EN, 
**                                 I3C1_DUMMY_SCL_PAD_SEL,               
**                                 I3C1_DUMMY_SCL_PAD_PUE,               
**                                 I3C1_DUMMY_SCL_PAD_IBE are removed.   
**                                 -In DCMRWF2 register                  
