rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37.h
**                                 bit field SAI_MCLK2_SEL is removed.   
**                                 5)DIGRF_TOP-                          
**                                 -LCR register is added                
**                                 -In PLLLSR register                   
**                                 Bit fields LRPDS, LDPDS are added.    
**                                 -In GPR register                      
**                                 Bit field LCR is added                
**                                 6)DSPSS-                              
**                                 -In DSP_TH_STATUS0 register           
**                                 Bit fields TH_PMEM_ECC_ERROR,         
**                                 TH_XMEM_EVEN_ECC_ERROR,               
**								   TH_XMEM_ODD_ECC_ERROR are removed.    
**                                 -In DSP_TH_STATUS1 register           
**                                 Bit fields TH_PMEM_ECC_ERROR,         
**                                 TH_XMEM_EVEN_ECC_ERROR,               
**								   TH_XMEM_ODD_ECC_ERROR are removed.    
**                                 -In TH_STATUS2 register                 
**                                 Bit fields TH_PMEM_ECC_ERROR,         
**                                 TH_XMEM_EVEN_ECC_ERROR,               
**								   TH_XMEM_ODD_ECC_ERROR are removed.    
**                                 -In TH_STATUS3 register                 
**                                 Bit fields TH_PMEM_ECC_ERROR,         
**                                 TH_XMEM_EVEN_ECC_ERROR,               
**								   TH_XMEM_ODD_ECC_ERROR are removed.    
**                                 -Registers DSP_CORE_INTR_CONFIG,      
**                                 DSP_CORE_INTR_REGISTER are removed.   
**                                 -In INTERRUPT_ENABLE_REGISTER register
**                                 Bit field RSVD is removed.            
**                                 -In CURR_ACTIVE_THRD register         
**                                 Bit field RSVD1 is removed.           
**                                 7)EMIOS-                              
**                                 -In UC_A register                     
**                                 Bit field RISE_FALL is added.         
**                                 8)FLASH-                              
**                                 -In ADR register                      
**                                 Bit fields A3 and A4 are removed.     
**								   AMCR, AMCRS, APEADR, ADATA register   
**                                 are removed.                          
**                                 ASPELOCK, ASSPELOCK registers are     
**                                 removed.                              
**                                 9)I3C-                                
**                                 -SWDATAB1 register is added           
**                                 -In MWMSG_DDR_MWMSG_DDR_CONTROL       
**								   register                              
**                                 Bit field ADDRCMD is added.           
**                                 DDR_MWMSG_DDR_CONTROL2 is added.      
**                                 10)LCU-                               
**                                 -In SCTRL register                    
**                                 Bit field size of                     
**								   SW_SYNC_SEL is changed from 2 to 1    
**                                 11)MC_CGM-                            
**                                 Registers MUX_12_CSC, MUX_12_CSS,     
**                                 MUX_12_DC_0, MUX_12_DIV_UPD_STAT,     
**								   MUX_13_CSC, MUX_13_CSS, MUX_13_DC_0,  
**								   MUX_13_DIV_UPD_STAT are added.        
**                                 12)MC_RGM-                            
**                                 -In DES register                      
**                                 Bit fields SWT2_RST, HSE_TMPR_RST,    
**                                 HSE_SNVS_RST are removed.             
**								   Bit field FXOSC_FAIL is added.        
**								   -In FES register                      
**                                 Bit field SWT2_RST is added.          
**                                 -In FERD register                     
**                                 Bit field SWT2_RST is added.          
**                                 -In FBRE register                     
**                                 Bit field SWT2_RST is added.          
**                                 13)PMC-                               
**                                 -In CONFIG register                   
**                                 Bit field FASTREC is removed          
**								   13)SDADC-                             
**                                 -In RSER register                     
**                                 Bit field GDIGE is removed.           
**
** -1.7 Jalaj Awasthi 18-Nov-22    1)Initial release based              
**                                 on RM Rev.2 Draft A                   
**                                 2)DCM_GPR-                            
**                                 -In DCMROD5 register                  
**                                 Bit field TEST_ACTIVATION_3_ERR       
**                                 is added.                             
**                                 -In DCMROD6 register                  
**                                 Bit fields CM7_0_AXI_ALARM,           
**                                 CM7_1_AXI_ALARM, CM7_2_AXI_ALARM,     
**                                 DSPSS_CORE_MEM_ECC0_ERR,              
**                                 DSPSS_CORE_MEM_ECC1_ERR,              
**                                 DSPSS_CORE_MEM_ECC2_ERR are removed.  
**                                 Bit fields OMU_0_ALARM, OMU_1_ALARM,  
**                                 OMU_2_ALARM, DMA1_SYS_GSKT_ALARM,     
**                                 DMA1_PERIPH_GSKT_ALARM,               
**                                 ZIPWIRE_GSKT_ALARM are added.         
**                                 -In DCMROF20 register                 
**                                 Bit field LMAUTO_DIS is removed.      
**                                 -In DCMRWD4 register                  
**                                 Bit field CM7_2_LOCKUP_EN is added.   
**                                 -In DCMRWD7 register                  
**                                 Bit fields I3C_DBG_DIS_CM7,           
**                                 I3C1_DBG_DIS_CM7_0,                   
**                                 IGF1_DBG_DIS_CM7_0 are removed.       
**                                 -In DCMRWD9 register                  
**                                 Bit fields I3C_DBG_DIS_CM7_1,         
**                                 I3C1_DBG_DIS_CM7_1,                   
**                                 IGF1_DBG_DIS_CM7_1 are removed.       
**                                 -In DCMRWD13 register                 
**                                 Bit fields I3C0_DBG_DIS_CM7_2,        
**                                 I3C1_DBG_DIS_CM7_2 are removed.       
**                                 -In DCMRWD14 register                  
**                                 Bit fields QSPI_FLASHA_ECC_ERR_EN,    
**                                 ETPU_GLEX_ERR_EN, OMU_0_ALARM_EN,     
**                                 OMU_1_ALARM_EN,OMU_2_ALARM_EN,        
**                                 DMA1_SYS_GSKT_ALARM_EN,               
**                                 DMA1_PERIPH_GSKT_ALARM_EN,            
**                                 ZIPWIRE_GSKT_ALARM_EN are added.      
**                                 Bit fields CM7_0_AXI_ALARM,           
**                                 CM7_1_AXI_ALARM,CM7_1_AXI_ALARM,      
**                                 DSPSS_CORE_MEM_ECC0_ERR_EN,           
**                                 DSPSS_CORE_MEM_ECC1_ERR_EN,           
**                                 DSPSS_CORE_MEM_ECC2_ERR_EN,           
**                                 DSPSS_CORE_MEM_ECC3_ERR_EN are removed.
**                                 -In DCMRWD15 register                 
**                                 Bit fields VDDA_SDADC0_GNG_ERR_EN,    
**                                 VDDA_SDADC1_GNG_ERR_EN,               
**                                 VDDA_SWG_GNG_ERR_EN,                  
**                                 VDD1P1_GNG2_ERR_EN, VDD2P5_GNG2_ERR_EN,
**                                 ... Till CM7_2_AHBS_ALARM_EN are added
**                                 -In DCMRWF1 register                  
**                                 Bit field PMIC_PGOOD_HNDSHK_BYP is    
**                                 added.                                
**                                 -In DCMRWF4 register                  
**                                 Bit fields MUX_MODE_EN_ADC0_S8,       
**                                 MUX_MODE_EN_ADC0_S9,                  
**                                 MUX_MODE_EN_ADC1_S14,                 
**                                 MUX_MODE_EN_ADC1_S22,                 
**                                 MUX_MODE_EN_ADC1_S23,                 
**                                 MUX_MODE_EN_ADC2_S8,                  
**                                 MUX_MODE_EN_ADC2_S9 are removed.      
**                                 -In DCMROPP2 register                 
**                                 Bit field POR_WDG_STAT44 is added.    
**                                 3)FLEXPWM-                            
**                                 -SM0CNT is removed                    
**                                 -SM_SMCNT is added                    
**                                 -SM0CTRL is removed                   
**                                 -SM_SMINIT is added                   
**                                 -SM0VAL0 is removed                   
**                                 -SMCTRL2 is added                     
**                                 -SM0VAL1 is removed                   
**                                 -SMCTRL is added                      
**                                 -SM0VAL2 is removed                   
**                                 -SMVAL0 is added                      
**                                 Similar changes have been encountered.
**                                 4)I3C module is removed.              
**                                 5)IGF-                                
**                                 In MCR_PRESR register                 
**                                 The bit field size of FPRE is changed 
**                                 from 10 to 6.                         
**                                 -In In MCR_RTHR register                
**                                 Bit field size of RTH is changed from 
**                                 24 to 6.                              
**                                 -In MCR_FTHR register                 
**                                 The bit field size of FTH is          
**								   changed from 24 to 6                  
**                                 6)MC_RGM-                             
**                                 -In DES register                      
**                                 Bit fields HSE_TMPR_RST,              
**                                 HSE_SNVS_RST are added.               
**                                 7)PIT_RTI-                             
**                                 -In TCTRL register                    
**                                 Bit field CHN is removed.             
**                                 8)SDADC-                              
**                                 -In RSER register                     
**                                 Bit field CDVEE is removed.
**                                 9)ETPU module is removed.           
**                                                          
** -1.8 Suman Rani 11-Apr-23       1)Initial release based
**                                 on RM Rev.2 Draft B.
**                                 2)DCM_GPR-
**                                 -Register DCMROD5
**                                  -TEST_ACTIVATION_3_ERR bit field is removed.
**                                 -Register DCMROD6 
**                                  -ETPU_GLEX_ERR bit field is removed.
**                                 -Register DCMROF1
**                                  -EMAC_MDC_CHID_0 bit field is replaced 
**                                  with MAC_MDC_CHID_0.
**                                  -EMAC_MDC_CHID_1 bit field is replaced
**                                  with MAC_MDC_CHID_1.
**                                 -Register DCMRWP1
**                                  -Following bitfields are added:
**                                  DEST_RESET_COUNT, SYS_REC_COUNTER,
**                                  SBAF_REC_DIS_FRST and SBAF_REC_DIS_DRST. 
**                                 -Register DCMRWD7
**                                  -Following bitfields are removed:
**                                  ETPU_DBG_DIS_CM7_0,SWG0_DBG_DIS_CM7_0 and
**                                  SWG1_DBG_DIS_CM7_0.
**                                 -Register DCMRWD9
**                                  -Following bitfields are removed:
**                                  ETPU_DBG_DIS_CM7_1,SWG0_DBG_DIS_CM7_1 and
**                                  SWG1_DBG_DIS_CM7_1. 
**                                 -Register DCMRWD13
**                                  -Following bitfields are removed:
**                                  ETPU_DBG_DIS_CM7_2,
**                                  SWG0_DBG_DIS_CM7_2 and
**                                  SWG1_DBG_DIS_CM7_2.
**                                 -Register DCMRWD14
**                                  -ETPU_GLEX_ERR_EN bit field
**                                  is removed.
**                                 -Register DCMRWF2
**                                  -PMC_TRIM_RGM_DCF__BYP_STDBY_EXT
**                                  bit field is replaced with
**                                  PMC_TRIM_RGM_DCF_BYP_STDBY_EXT.
**                                 3)DIGRF_TOP-
**                                 -SLCR register is removed.
**                                 4)FLEXPWM-
**                                 -SM prefix is removed from the
**                                 registers within SM array.
**                                 -Register array FAULT is removed and
**                                 replaced with FP_CTRL,FP_STS,FP_FILT,
**                                 FP_TST and FP_CTRL2 registers array.
**                                 -Register FAULT_FCTRL is replaced
**                                 with FP_CTRL.
**                                 -Register FAULT_FSTS is replaced
**                                 with FP_STS.
**                                 -Register FAULT_FFILT is replaced
**                                 with FP_FILT.
**                                 -Register FAULT_FTST is replaced
**                                 with FP_TST.
**                                 -Register FAULT_FCTRL2 is replaced
**                                 with FP_CTRL2.
**                                 -Register SM0BIST_CTRL is replaced
**                                 with SM0_BIST_CTRL.
**                                 -Register SM0BIST_CTRL1 is replaced 
**                                 with SM0_BIST_CTRL1.
**                                 -Register SM1BIST_CTRL is replaced
**                                 with SM1_BIST_CTRL.
**                                 -Register SM1BIST_CTRL1 is replaced
**                                 with SM1_BIST_CTRL1.
**                                 -Register SM2BIST_CTRL is replaced
**                                 with SM2_BIST_CTRL.
**                                 -Register SM2BIST_CTRL1 is replaced
**                                 with SM2_BIST_CTRL1.
**                                 -Register SM3BIST_CTRL is replaced
**                                 with SM3_BIST_CTRL.
**                                 -Register SM3BIST_CTRL1 is replaced
**                                 with SM3_BIST_CTRL1.
**                                 -Register SM0BIST_STATUS is replaced 
**                                 with SM0_BIST_STATUS.
**                                 -Register SM0BIST_STATUS1 is replaced
**                                 with SM0_BIST_STATUS1.
**                                 -Register SM1BIST_STATUS is replaced
**                                 with SM1_BIST_STATUS.
**                                 -Register SM1BIST_STATUS1 is replaced
**                                 with SM1_BIST_STATUS1.
**                                 -Register SM2BIST_STATUS is replaced 
**                                 with SM2_BIST_STATUS.
**                                 -Register SM2BIST_STATUS1 is replaced
**                                 with SM2_BIST_STATUS1.
**                                 -Register SM3BIST_STATUS is replaced
**                                 with SM3_BIST_STATUS.
**                                 -Register SM3BIST_STATUS1 is replaced
**                                 with SM3_BIST_STATUS1.
**                                 5)LPCMP-                               
**                                 -Register CCR0                         
**                                  -LINKEN bit field is removed.         
**                                 -Register DCR                          
**                                  -DAC_HPMD bit field is added.
**                                 6)MC_RGM-
**                                 -Registers FRENTC and LPDEBUG
**                                 are removed. 
**                                 7)MDM_AP-                                             
**                                 -Registers MDMAPETPUCTRLEN and         
**                                 MDMAPETPUSTTSEN are removed.
**                                 -Register MDMAPCTL                     
**                                  -Following bitfields are added:       
**                                  CM7_0_CORE_ACCESS,CM7_1_CORE_ACCESS,
**                                  CM7_2_CORE_ACCESS and CM7_2_CHK_CORE_ACCESS.
**                                 8)MSCM-
**                                 -Registers IAHBCFGREG and IAHBCFGREG1
**                                 are removed.
**                                 9)TRGMUX_APP-
**                                 -Following Registers are removed:
**                                  -ETPU_A_INPUT,ETPU_AB_INPUT,
**                                  ETPU_B_INPUT,ETPU1_ODIS and
**                                  ETPU2_ODIS.
**
** -1.9 Suman Rani    29-Aug-23    1)Initial release based              
**                                 on RM Rev2.
**                                 2)ADC-
**                                 -AMSIO Register:
**                                  -CMPCTRL0 bitfield is added.
**                                 3)CONFIGURATION_GPR-
**                                 -QSPI_SFP_CTRL and QSPI_SFP_CTRL_ALT
**                                 registers are removed.
**                                 4)DCM_GPR-
**                                 -DCMRWD13 Register:
**                                  -IGF1_DBG_DIS_CM7_2 bitfield
**                                  is removed.
**                                 -DCMRWF3 Register:
**                                  -LFAST_RX_TERM_EN bitfield is added.
**                                 5)DSPI_MSC-
**                                 -MCR Register:
**                                  -PES bitfield is added.
**                                 -SR Register:
**                                  -SPEF and DPEF bitfields are added.
**                                 -RSER Register:
**                                  -SPEF_RE and DPEF_RE bitfields are added.
**                                 -PUSHR Register:
**                                  -PP and PE bitfields are added.
**                                 -DSICR0 Register:
**                                  -PP, PE and PES bitfields are added.
**                                 6)FLEXPWM-
**                                 -DLLCTRL Register is removed.
**                                  -FP_ CTRL,FP_ STS,FP_ FILT,FP_ TST 
**                                  and FP_CTRL2 registers are rolled 
**                                  into FP register array.
**                                 7)MC_ME-
**                                 -PRTN0_PUPD Register:
**                                  -PCUD bitfield is removed.
**                                 -PRTN0_COFB0_CLKEN and PRTN0_COFB1_CLKEN 
**                                 registers are removed.
**                                 8)MSCM-
**                                 -CPXCFG3,CP0CFG3,CP1CFG3,CP2CFG3,
**                                 IRCP0ISR3,IRCP0IGR3,IRCP1ISR3,
**                                 IRCP1IGR3,IRCP2ISR3 and IRCP2IGR3
**                                 registers are removed.
**                                 9)OMU_CM7-
**                                 -GZRUDR Register is added.
**                                 10)PFLASH-
**                                 -PFAPR Register:
**                                  -M3AP bitfield is added.
**
** -2.0 Jalaj Awasthi 28-Mar-24    1)Initial release based               
**                                 on RM Rev 3.                          
**                                 2)CONFIGURATION_GPR-                  
**                                 CONFIG_REG_GPR register is added.     
**                                 3)DCM_GPR-                            
**                                 -DCMROD3 Register:                    
**                                  -Bit field name is changed from      
**                                  EMAC_GSKT_ALARM to MAC_GSKT_ALARM.   
**                                 -DCMROD5 Register:                    
**                                  -Bit field name is changed from      
**                                  EMAC_RDATA_EDC_ERR to MAC_RDATA_EDC  
**                                  _ERR.                                
**                                 -DCMRWD5 Register:                    
**                                  -Bit field name is changed from      
**                                  EMAC_RDATA_EDC_ERR_EN to MAC_RDATA   
**                                  _EDC_ERR_EN.                         
**                                 -DCMRWF1 Register:                    
**                                  -Bit field name is changed from      
**                                  EMAC_CONF_SEL to MAC_CONF_SEL.       
**                                 4)DIGRF_TOP-                          
**                                 -PLLCR Register:                      
**                                  -Bit fields PLCKCW and LPCFG         
**                                   are removed.                        
**                                 -GPR Register:                        
**                                  -Bit field GPR is removed.           
**                                  -Bit field LFAST_TX_OBE_EN is added. 
**                                 5)IGF-                                
**                                 -MCR_PRESR Register:                  
**                                  -Bit field size of FPRE is changed   
