rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37.h
**                                   from 6 to 10.                       
**                                 -MCR_RTHR Register:                   
**                                  -Bit field size of RTH is changed    
**                                   from 6 to 24.                       
**                                 -MCR_FTHR Register:                   
**                                  -Bit field size of FTH is changed    
**                                   from 6 to 24.                       
**                                 6)MSCM-                               
**                                 -IRCP0ISR3, IRCP0IGR3, IRCP1ISR3,     
**                                  IRCP1IGR3, IRCP2ISR3, IRCP2IGR3      
**                                  registers are added.                 
**                                 7)SDADC-                              
**                                 -CCR register is added.                                          
**                                 8)LBIST and MBIST IRQ(interrupts) are removed.
**
** ############################################################################################
*/

/*!
 * @file S32K37.h
 * @version 2.0
 * @date 2024-03-28
 * @brief Peripheral Access Layer for S32K37
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/* Prevention from multiple including the same memory map */
#if !defined(S32K37_H_)  /* Check if memory map has not been already included */
#define S32K37_H_

/* ----------------------------------------------------------------------------
   -- IP Header Files
   ---------------------------------------------------------------------------- */

/* IP Header Files List */
#include "S32K37_ADC.h"
#include "S32K37_ADC_BIST.h"
#include "S32K37_ADC_BIST_FIR.h"
#include "S32K37_AXBS_LITE.h"
#include "S32K37_BCTU.h"
#include "S32K37_CMU_FC.h"
#include "S32K37_CMU_FM.h"
#include "S32K37_CONFIGURATION_GPR.h"
#include "S32K37_CRC.h"
#include "S32K37_DCM.h"
#include "S32K37_DCM_GPR.h"
#include "S32K37_DIGRF_TOP.h"
#include "S32K37_DMA.h"
#include "S32K37_DMAMUX.h"
#include "S32K37_DSPI_MSC.h"
#include "S32K37_DSPSS.h"
#include "S32K37_D_IP_SWG_SYN.h"
#include "S32K37_EIM.h"
#include "S32K37_EIM_1.h"
#include "S32K37_EIM_2.h"
#include "S32K37_EMAC.h"
#include "S32K37_EMIOS.h"
#include "S32K37_ERM.h"
#include "S32K37_FCCU.h"
#include "S32K37_FIRC.h"
#include "S32K37_FLASH.h"
#include "S32K37_FLEXCAN.h"
#include "S32K37_FLEXIO.h"
#include "S32K37_FLEXPWM.h"
#include "S32K37_FXOSC.h"
#include "S32K37_IGF.h"
#include "S32K37_INTM.h"
#include "S32K37_JDC.h"
#include "S32K37_LCU.h"
#include "S32K37_LPCMP.h"
#include "S32K37_LPI2C.h"
#include "S32K37_LPSPI.h"
#include "S32K37_LPUART.h"
#include "S32K37_MCM_CM7.h"
#include "S32K37_MC_CGM.h"
#include "S32K37_MC_ME.h"
#include "S32K37_MC_RGM.h"
#include "S32K37_MDM_AP.h"
#include "S32K37_MSCM.h"
#include "S32K37_MU.h"
#include "S32K37_OMU_CM7.h"
#include "S32K37_PFLASH.h"
#include "S32K37_PIT.h"
#include "S32K37_PLL.h"
#include "S32K37_PMC.h"
#include "S32K37_PRAMC.h"
#include "S32K37_QUADSPI.h"
#include "S32K37_QUADSPI_ARDB.h"
#include "S32K37_RTC.h"
#include "S32K37_SDADC.h"
#include "S32K37_SDA_AP.h"
#include "S32K37_SELFTEST_GPR.h"
#include "S32K37_SEMA42.h"
#include "S32K37_SIPI1.h"
#include "S32K37_SIRC.h"
#include "S32K37_SIUL2.h"
#include "S32K37_STCU.h"
#include "S32K37_STM.h"
#include "S32K37_SWT.h"
#include "S32K37_TCD_0.h"
#include "S32K37_TCD_1.h"
#include "S32K37_TEMPSENSE.h"
#include "S32K37_TRGMUX_APP.h"
#include "S32K37_TRGMUX_MSC.h"
#include "S32K37_VIRT_WRAPPER.h"
#include "S32K37_WKPU.h"
#include "S32K37_XBIC.h"
#include "S32K37_XRDC.h"
#include "S32K37_NVIC.h"
#include "S32K37_SCB.h"
#include "S32K37_SYSTICK.h"
#include "S32K37_MPU.h"

#endif  /* #if !defined(S32K37_H_) */
